---
kind: property
id: P:Autodesk.Revit.DB.BaseExportOptions.Colors
source: html/29f6fbf4-0651-a3d6-7ee6-86297335b03d.htm
---
# Autodesk.Revit.DB.BaseExportOptions.Colors Property

Export color mode.
 Default value is ExportColorMode.IndexColors.

## Syntax (C#)
```csharp
public ExportColorMode Colors { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration